; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block hand - object
          stickyh slippery - hand)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty ?h - hand)
	       (holding ?h - hand ?x - block)
               (movable ?x - block)
               (sticky ?x - block)
	       )

  (:action pick-up-sl
	     :parameters (?x - block ?h - slippery)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)))

  (:action pick-up-st
	     :parameters (?x - block ?h - stickyh)
	     :precondition (and (clear ?x) (ontable ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty ?h))
		   (holding ?h ?x)
                   (sticky ?x)
                      ))

  (:action put-down
	     :parameters (?x - block ?h - hand)
	     :precondition (and (holding ?h ?x))
	     :effect
	     (and (not (holding ?h ?x))
		   (clear ?x)
		   (handempty ?h)
		   (ontable ?x)))

  (:action stack
	     :parameters (?x - block ?y - block ?h - hand)
	     :precondition (and (holding ?h ?x) (clear ?y))
	     :effect
	     (and (not (holding ?h ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty ?h)
		   (on ?x ?y)))

  (:action unstack-sl
	     :parameters (?x - block ?y - block ?h - slippery)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))))

  (:action unstack-st
	     :parameters (?x - block ?y - block ?h - stickyh)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty ?h)(movable ?x))
	     :effect
	     (and  
                   (holding ?h ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty ?h))
		   (not (on ?x ?y))
                   (sticky ?x)))


)

; problem
(define (problem BW-rand-15)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15  - block
           h1 - slippery
          h2 - stickyh)
(:init
(handempty h1)
(handempty h2)
(on b1 b12)
(on b2 b10)
(on b3 b9)
(on b4 b2)
(on b5 b6)
(on b6 b8)
(on b7 b11)
(on b8 b4)
(on b9 b13)
(on b10 b1)
(on b11 b3)
(on b12 b15)
(ontable b13)
(on b14 b5)
(ontable b15)
(clear b7)
(clear b14)
(movable b1)
(movable b2)
(movable b3)
(movable b4)
(movable b5)
(movable b6)
(movable b7)
(movable b8)
(movable b9)
(movable b10)
(movable b11)
(movable b12)
(movable b13)
(movable b14)
(movable b15)
)
(:goal
(and
(on b1 b15)
(on b3 b12)
(on b4 b2)
(on b6 b13)
(on b7 b8)
(on b8 b14)
(on b9 b6)
(on b10 b11)
(on b11 b4)
(on b12 b1)
(on b13 b7)
(on b14 b5)
(on b15 b9))
)
)

; plan
1. (unstack-st b7 b11 h2)
   deleted: (clear b7) (handempty h2) (on b7 b11)
   added: (holding h2 b7) (clear b11) (sticky b7)
   goals met: 2 of 13
2. (unstack-sl b11 b3 h1)
   deleted: (clear b11) (handempty h1) (on b11 b3)
   added: (holding h1 b11) (clear b3)
   goals met: 2 of 13
3. (put-down b11 h1)
   deleted: (holding h1 b11)
   added: (clear b11) (handempty h1) (ontable b11)
   goals met: 2 of 13
4. (unstack-sl b3 b9 h1)
   deleted: (clear b3) (handempty h1) (on b3 b9)
   added: (holding h1 b3) (clear b9)
   goals met: 2 of 13
5. (put-down b7 h2)
   deleted: (holding h2 b7)
   added: (clear b7) (handempty h2) (ontable b7)
   goals met: 2 of 13
6. (unstack-st b9 b13 h2)
   deleted: (clear b9) (handempty h2) (on b9 b13)
   added: (holding h2 b9) (clear b13) (sticky b9)
   goals met: 2 of 13
7. (put-down b3 h1)
   deleted: (holding h1 b3)
   added: (clear b3) (handempty h1) (ontable b3)
   goals met: 2 of 13
8. (put-down b9 h2)
   deleted: (holding h2 b9)
   added: (clear b9) (handempty h2) (ontable b9)
   goals met: 2 of 13
9. (pick-up-sl b13 h1)
   deleted: (ontable b13) (clear b13) (handempty h1)
   added: (holding h1 b13)
   goals met: 2 of 13
10. (stack b13 b7 h1)
   deleted: (holding h1 b13) (clear b7)
   added: (clear b13) (handempty h1) (on b13 b7)
   goals met: 3 of 13
11. (unstack-st b14 b5 h2)
   deleted: (clear b14) (handempty h2) (on b14 b5)
   added: (holding h2 b14) (clear b5) (sticky b14)
   goals met: 2 of 13
12. (put-down b14 h2)
   deleted: (holding h2 b14)
   added: (clear b14) (handempty h2) (ontable b14)
   goals met: 2 of 13
13. (unstack-st b5 b6 h2)
   deleted: (clear b5) (handempty h2) (on b5 b6)
   added: (holding h2 b5) (clear b6) (sticky b5)
   goals met: 2 of 13
14. (put-down b5 h2)
   deleted: (holding h2 b5)
   added: (clear b5) (handempty h2) (ontable b5)
   goals met: 2 of 13
15. (pick-up-sl b14 h1)
   deleted: (ontable b14) (clear b14) (handempty h1)
   added: (holding h1 b14)
   goals met: 2 of 13
16. (stack b14 b5 h1)
   deleted: (holding h1 b14) (clear b5)
   added: (clear b14) (handempty h1) (on b14 b5)
   goals met: 3 of 13
17. (unstack-st b6 b8 h2)
   deleted: (clear b6) (handempty h2) (on b6 b8)
   added: (holding h2 b6) (clear b8) (sticky b6)
   goals met: 3 of 13
18. (stack b6 b13 h2)
   deleted: (holding h2 b6) (clear b13)
   added: (clear b6) (handempty h2) (on b6 b13)
   goals met: 4 of 13
19. (unstack-st b8 b4 h2)
   deleted: (clear b8) (handempty h2) (on b8 b4)
   added: (holding h2 b8) (clear b4) (sticky b8)
   goals met: 4 of 13
20. (stack b8 b14 h2)
   deleted: (holding h2 b8) (clear b14)
   added: (clear b8) (handempty h2) (on b8 b14)
   goals met: 5 of 13
21. (pick-up-sl b11 h1)
   deleted: (ontable b11) (clear b11) (handempty h1)
   added: (holding h1 b11)
   goals met: 5 of 13
22. (stack b11 b4 h1)
   deleted: (holding h1 b11) (clear b4)
   added: (clear b11) (handempty h1) (on b11 b4)
   goals met: 6 of 13
23. (pick-up-sl b9 h1)
   deleted: (ontable b9) (clear b9) (handempty h1)
   added: (holding h1 b9)
   goals met: 6 of 13
24. (stack b9 b6 h1)
   deleted: (holding h1 b9) (clear b6)
   added: (clear b9) (handempty h1) (on b9 b6)
   goals met: 7 of 13
25. (pick-up-sl b3 h1)
   deleted: (ontable b3) (clear b3) (handempty h1)
   added: (holding h1 b3)
   goals met: 7 of 13
26. (unstack-st b11 b4 h2)
   deleted: (clear b11) (handempty h2) (on b11 b4)
   added: (holding h2 b11) (clear b4) (sticky b11)
   goals met: 6 of 13
27. (put-down b11 h2)
   deleted: (holding h2 b11)
   added: (clear b11) (handempty h2) (ontable b11)
   goals met: 6 of 13
28. (unstack-st b4 b2 h2)
   deleted: (clear b4) (handempty h2) (on b4 b2)
   added: (holding h2 b4) (clear b2) (sticky b4)
   goals met: 5 of 13
29. (put-down b4 h2)
   deleted: (holding h2 b4)
   added: (clear b4) (handempty h2) (ontable b4)
   goals met: 5 of 13
30. (unstack-st b2 b10 h2)
   deleted: (clear b2) (handempty h2) (on b2 b10)
   added: (holding h2 b2) (clear b10) (sticky b2)
   goals met: 5 of 13
31. (put-down b2 h2)
   deleted: (holding h2 b2)
   added: (clear b2) (handempty h2) (ontable b2)
   goals met: 5 of 13
32. (unstack-st b10 b1 h2)
   deleted: (clear b10) (handempty h2) (on b10 b1)
   added: (holding h2 b10) (clear b1) (sticky b10)
   goals met: 5 of 13
33. (stack b10 b11 h2)
   deleted: (holding h2 b10) (clear b11)
   added: (clear b10) (handempty h2) (on b10 b11)
   goals met: 6 of 13
34. (unstack-st b1 b12 h2)
   deleted: (clear b1) (handempty h2) (on b1 b12)
   added: (holding h2 b1) (clear b12) (sticky b1)
   goals met: 6 of 13
35. (stack b3 b12 h1)
   deleted: (holding h1 b3) (clear b12)
   added: (clear b3) (handempty h1) (on b3 b12)
   goals met: 7 of 13
36. (put-down b1 h2)
   deleted: (holding h2 b1)
   added: (clear b1) (handempty h2) (ontable b1)
   goals met: 7 of 13
37. (pick-up-sl b4 h1)
   deleted: (ontable b4) (clear b4) (handempty h1)
   added: (holding h1 b4)
   goals met: 7 of 13
38. (stack b4 b2 h1)
   deleted: (holding h1 b4) (clear b2)
   added: (clear b4) (handempty h1) (on b4 b2)
   goals met: 8 of 13
39. (pick-up-sl b1 h1)
   deleted: (ontable b1) (clear b1) (handempty h1)
   added: (holding h1 b1)
   goals met: 8 of 13
40. (unstack-st b3 b12 h2)
   deleted: (clear b3) (handempty h2) (on b3 b12)
   added: (holding h2 b3) (clear b12) (sticky b3)
   goals met: 7 of 13
41. (put-down b1 h1)
   deleted: (holding h1 b1)
   added: (clear b1) (handempty h1) (ontable b1)
   goals met: 7 of 13
42. (unstack-sl b12 b15 h1)
   deleted: (clear b12) (handempty h1) (on b12 b15)
   added: (holding h1 b12) (clear b15)
   goals met: 7 of 13
43. (stack b12 b1 h1)
   deleted: (holding h1 b12) (clear b1)
   added: (clear b12) (handempty h1) (on b12 b1)
   goals met: 8 of 13
44. (pick-up-sl b15 h1)
   deleted: (ontable b15) (clear b15) (handempty h1)
   added: (holding h1 b15)
   goals met: 8 of 13
45. (stack b15 b9 h1)
   deleted: (holding h1 b15) (clear b9)
   added: (clear b15) (handempty h1) (on b15 b9)
   goals met: 9 of 13
46. (unstack-sl b12 b1 h1)
   deleted: (clear b12) (handempty h1) (on b12 b1)
   added: (holding h1 b12) (clear b1)
   goals met: 8 of 13
47. (put-down b12 h1)
   deleted: (holding h1 b12)
   added: (clear b12) (handempty h1) (ontable b12)
   goals met: 8 of 13
48. (stack b3 b12 h2)
   deleted: (holding h2 b3) (clear b12)
   added: (clear b3) (handempty h2) (on b3 b12)
   goals met: 9 of 13
49. (pick-up-sl b1 h1)
   deleted: (ontable b1) (clear b1) (handempty h1)
   added: (holding h1 b1)
   goals met: 9 of 13
50. (stack b1 b15 h1)
   deleted: (holding h1 b1) (clear b15)
   added: (clear b1) (handempty h1) (on b1 b15)
   goals met: 10 of 13
51. (unstack-sl b3 b12 h1)
   deleted: (clear b3) (handempty h1) (on b3 b12)
   added: (holding h1 b3) (clear b12)
   goals met: 9 of 13
52. (put-down b3 h1)
   deleted: (holding h1 b3)
   added: (clear b3) (handempty h1) (ontable b3)
   goals met: 9 of 13
53. (pick-up-sl b12 h1)
   deleted: (ontable b12) (clear b12) (handempty h1)
   added: (holding h1 b12)
   goals met: 9 of 13
54. (stack b12 b1 h1)
   deleted: (holding h1 b12) (clear b1)
   added: (clear b12) (handempty h1) (on b12 b1)
   goals met: 10 of 13
55. (pick-up-sl b3 h1)
   deleted: (ontable b3) (clear b3) (handempty h1)
   added: (holding h1 b3)
   goals met: 10 of 13
56. (stack b3 b12 h1)
   deleted: (holding h1 b3) (clear b12)
   added: (clear b3) (handempty h1) (on b3 b12)
   goals met: 11 of 13
57. (unstack-sl b10 b11 h1)
   deleted: (clear b10) (handempty h1) (on b10 b11)
   added: (holding h1 b10) (clear b11)
   goals met: 10 of 13
58. (put-down b10 h1)
   deleted: (holding h1 b10)
   added: (clear b10) (handempty h1) (ontable b10)
   goals met: 10 of 13
59. (pick-up-sl b11 h1)
   deleted: (ontable b11) (clear b11) (handempty h1)
   added: (holding h1 b11)
   goals met: 10 of 13
60. (stack b11 b4 h1)
   deleted: (holding h1 b11) (clear b4)
   added: (clear b11) (handempty h1) (on b11 b4)
   goals met: 11 of 13
61. (pick-up-sl b10 h1)
   deleted: (ontable b10) (clear b10) (handempty h1)
   added: (holding h1 b10)
   goals met: 11 of 13
62. (unstack-st b3 b12 h2)
   deleted: (clear b3) (handempty h2) (on b3 b12)
   added: (holding h2 b3) (clear b12)
   goals met: 10 of 13
63. (stack b10 b11 h1)
   deleted: (holding h1 b10) (clear b11)
   added: (clear b10) (handempty h1) (on b10 b11)
   goals met: 11 of 13
64. (unstack-sl b12 b1 h1)
   deleted: (clear b12) (handempty h1) (on b12 b1)
   added: (holding h1 b12) (clear b1)
   goals met: 10 of 13
65. (put-down b12 h1)
   deleted: (holding h1 b12)
   added: (clear b12) (handempty h1) (ontable b12)
   goals met: 10 of 13
66. (unstack-sl b1 b15 h1)
   deleted: (clear b1) (handempty h1) (on b1 b15)
   added: (holding h1 b1) (clear b15)
   goals met: 9 of 13
67. (put-down b1 h1)
   deleted: (holding h1 b1)
   added: (clear b1) (handempty h1) (ontable b1)
   goals met: 9 of 13
68. (pick-up-sl b12 h1)
   deleted: (ontable b12) (clear b12) (handempty h1)
   added: (holding h1 b12)
   goals met: 9 of 13
69. (stack b12 b1 h1)
   deleted: (holding h1 b12) (clear b1)
   added: (clear b12) (handempty h1) (on b12 b1)
   goals met: 10 of 13
70. (stack b3 b12 h2)
   deleted: (holding h2 b3) (clear b12)
   added: (clear b3) (handempty h2) (on b3 b12)
   goals met: 11 of 13
71. (unstack-sl b15 b9 h1)
   deleted: (clear b15) (handempty h1) (on b15 b9)
   added: (holding h1 b15) (clear b9)
   goals met: 10 of 13
72. (unstack-st b9 b6 h2)
   deleted: (clear b9) (handempty h2) (on b9 b6)
   added: (holding h2 b9) (clear b6)
   goals met: 9 of 13
73. (put-down b9 h2)
   deleted: (holding h2 b9)
   added: (clear b9) (handempty h2) (ontable b9)
   goals met: 9 of 13
74. (stack b15 b9 h1)
   deleted: (holding h1 b15) (clear b9)
   added: (clear b15) (handempty h1) (on b15 b9)
   goals met: 10 of 13
75. (unstack-sl b6 b13 h1)
   deleted: (clear b6) (handempty h1) (on b6 b13)
   added: (holding h1 b6) (clear b13)
   goals met: 9 of 13
76. (unstack-st b13 b7 h2)
   deleted: (clear b13) (handempty h2) (on b13 b7)
   added: (holding h2 b13) (clear b7) (sticky b13)
   goals met: 8 of 13
77. (put-down b13 h2)
   deleted: (holding h2 b13)
   added: (clear b13) (handempty h2) (ontable b13)
   goals met: 8 of 13
78. (stack b6 b13 h1)
   deleted: (holding h1 b6) (clear b13)
   added: (clear b6) (handempty h1) (on b6 b13)
   goals met: 9 of 13
79. (pick-up-sl b7 h1)
   deleted: (ontable b7) (clear b7) (handempty h1)
   added: (holding h1 b7)
   goals met: 9 of 13
80. (stack b7 b8 h1)
   deleted: (holding h1 b7) (clear b8)
   added: (clear b7) (handempty h1) (on b7 b8)
   goals met: 10 of 13
81. (unstack-sl b6 b13 h1)
   deleted: (clear b6) (handempty h1) (on b6 b13)
   added: (holding h1 b6) (clear b13)
   goals met: 9 of 13
82. (put-down b6 h1)
   deleted: (holding h1 b6)
   added: (clear b6) (handempty h1) (ontable b6)
   goals met: 9 of 13
83. (pick-up-sl b13 h1)
   deleted: (ontable b13) (clear b13) (handempty h1)
   added: (holding h1 b13)
   goals met: 9 of 13
84. (stack b13 b7 h1)
   deleted: (holding h1 b13) (clear b7)
   added: (clear b13) (handempty h1) (on b13 b7)
   goals met: 10 of 13
85. (pick-up-sl b6 h1)
   deleted: (ontable b6) (clear b6) (handempty h1)
   added: (holding h1 b6)
   goals met: 10 of 13
86. (stack b6 b13 h1)
   deleted: (holding h1 b6) (clear b13)
   added: (clear b6) (handempty h1) (on b6 b13)
   goals met: 11 of 13
87. (unstack-sl b15 b9 h1)
   deleted: (clear b15) (handempty h1) (on b15 b9)
   added: (holding h1 b15) (clear b9)
   goals met: 10 of 13
88. (put-down b15 h1)
   deleted: (holding h1 b15)
   added: (clear b15) (handempty h1) (ontable b15)
   goals met: 10 of 13
89. (pick-up-sl b9 h1)
   deleted: (ontable b9) (clear b9) (handempty h1)
   added: (holding h1 b9)
   goals met: 10 of 13
90. (stack b9 b6 h1)
   deleted: (holding h1 b9) (clear b6)
   added: (clear b9) (handempty h1) (on b9 b6)
   goals met: 11 of 13
91. (pick-up-sl b15 h1)
   deleted: (ontable b15) (clear b15) (handempty h1)
   added: (holding h1 b15)
   goals met: 11 of 13
92. (unstack-st b3 b12 h2)
   deleted: (clear b3) (handempty h2) (on b3 b12)
   added: (holding h2 b3) (clear b12)
   goals met: 10 of 13
93. (stack b15 b9 h1)
   deleted: (holding h1 b15) (clear b9)
   added: (clear b15) (handempty h1) (on b15 b9)
   goals met: 11 of 13
94. (unstack-sl b12 b1 h1)
   deleted: (clear b12) (handempty h1) (on b12 b1)
   added: (holding h1 b12) (clear b1)
   goals met: 10 of 13
95. (put-down b12 h1)
   deleted: (holding h1 b12)
   added: (clear b12) (handempty h1) (ontable b12)
   goals met: 10 of 13
96. (pick-up-sl b1 h1)
   deleted: (ontable b1) (clear b1) (handempty h1)
   added: (holding h1 b1)
   goals met: 10 of 13
97. (stack b1 b15 h1)
   deleted: (holding h1 b1) (clear b15)
   added: (clear b1) (handempty h1) (on b1 b15)
   goals met: 11 of 13
98. (pick-up-sl b12 h1)
   deleted: (ontable b12) (clear b12) (handempty h1)
   added: (holding h1 b12)
   goals met: 11 of 13
99. (stack b12 b1 h1)
   deleted: (holding h1 b12) (clear b1)
   added: (clear b12) (handempty h1) (on b12 b1)
   goals met: 12 of 13
100. (stack b3 b12 h2)
   deleted: (holding h2 b3) (clear b12)
   added: (clear b3) (handempty h2) (on b3 b12)
   goals met: 13 of 13
